Revit 2024 API
BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Class
 Failures about EnergyAnalysisUtilitiesDBFailures.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class EnergyAnalysisUtilitiesDBFailures
Visual Basic
Public NotInheritable Class EnergyAnalysisUtilitiesDBFailures
Visual C++
public ref class EnergyAnalysisUtilitiesDBFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisUtilitiesDBFailures
See Also
BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Members
Autodesk.Revit.DB Namespace